app/controllers/sessions_controller.rb

INSERT INTO "users" ("provider", "uid", "name", "created_at", "updated_at") VALUES ('soundcloud', 93777, 'Matt Redding', '2011-07-10 05:56:14.310676', '2011-07-10 05:56:14.310676')
SELECT "users".* FROM "users" WHERE "users"."provider" = 'twitter' AND "users"."uid" = '19380272' LIMIT 1
---
  def create
    # raise request.env["omniauth.auth"].to_yaml
    auth = request.env["omniauth.auth"]
    user = User.find_by_provider_and_uid(auth["provider"], auth["uid"].to_s) || User.create_with_omniauth(auth)